package ex0923_interface;

public class ex01 {

	public static void main(String[] args) {
		// interface
		// - 클래스들이 구현해야 하는 "공통되는 기능들"을 미리 지정
		// - 작업명세서 or 프로젝트설계도
		// - 기능만 정의함으로써 구현 객체의 "같은 동작 보장(구현 강제)"
		
		
		
		
		//추상클래스
		//public abstract class 클래스명
		// - 추상 메소드를 하나라도 가지고 있다면 반드시 추상 클래스
		// - 일반메소드만 가지고 있더라도 abstract키워드를 사용하면 추상 클래스를 만들수 있다
		
		// **추상클래스는 객체생성을 할 수 없다.
		
		
		//추상메소드		
		// - 
		// - 

		//상속
		// - 다중 상속이 불가능 하다 
		// - 상속 횟수에 제한이 없다
		// - 모든 클래스는 Object(최상위클래스) 상속 받는다.
	
		
		
		
		
		
		

	}

}
